In [2]:
#라이브러리 임포트
import numpy as np
import pandas as pd

In [7]:
a=[4,7,8,9,6]
x=pd.Series(a,index=['a','b','c','d','e'])
print(x.index)
print(x.values)
print(x.dtype) # 기본적으로 int64형을 씀(long형)
print(x)

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
[4 7 8 9 6]
int64
a    4
b    7
c    8
d    9
e    6
dtype: int64

In [14]:
# 딕셔너리로 시리즈 생성
b={'홍길동':70,'김승현':87,'박정현':85, 'lee':80}
s1=pd.Series(b)
print(s1.index)
print(s1.values)
s1.index=['hong','kim','park','lee']
print(s1)

Index(['홍길동', '김승현', '박정현', 'lee'], dtype='object')
[70 87 85 80]
hong    70
kim     87
park    85
lee     80
dtype: int64

In [18]:
print(s1['kim'])
print(s1[['kim','park']]) # s1['kim','park'] 으로 찾을 수 없음 하나의 리스트로 만들어줘야 함
print(s1['hong':'park']) # 문자로 인덱스 되었을 때, 마지막 값도 가져옴

87
kim     87
park    85
dtype: int64
hong    70
kim     87
park    85
dtype: int64

In [24]:
s1=pd.Series([10,20,40,30,29])
s2=pd.Series([100,200,400,300,290])
s3=s1+s2
s3
#s1[1:3] # 숫자로 인덱스 되었을 때, 마지막 값은 가져오지 않음
print(s3+1000)

0    1110
1    1220
2    1440
3    1330
4    1319
dtype: int64

In [93]:
# DataFrame 정의하기 : 표형테로 데이터를 저장할 수 있음
# names, years, points 는 각각 필드명이 된다
names=['민준','현우','서연','동현','지현']
years=[2013,2014,2013,2015,2016]
points=[1.5,1.7,3.6,2.4,2.9]
data={'names':names, 'years':years, 'points':points}
df=pd.DataFrame(data)
df

  names  years  points
0    민준   2013     1.5
1    현우   2014     1.7
2    서연   2013     3.6
3    동현   2015     2.4
4    지현   2016     2.9

In [99]:
# 행, 열 바꾸기 1
data=[names,years,points] # 실제로는 2차원 배열
data
data1=zip(data[0],data[1],data[2])

In [100]:
df3=pd.DataFrame(data1, columns=['names','years','points'],
                 index=['one','two','three','four','five'])
df3 # 인덱스 지정 가능

      names  years  points
one      민준   2013     1.5
two      현우   2014     1.7
three    서연   2013     3.6
four     동현   2015     2.4
five     지현   2016     2.9

In [129]:
df3.columns.name='Column_name'
df3.index.name='index_name'
df3.describe()

Column_name       years    points  penalty
count           5.00000  5.000000      5.0
mean         2014.20000  2.420000      0.1
std             1.30384  0.864292      0.0
min          2013.00000  1.500000      0.1
25%          2013.00000  1.700000      0.1
50%          2014.00000  2.400000      0.1
75%          2015.00000  2.900000      0.1
max          2016.00000  3.600000      0.1

In [70]:
# 2차원 배열로 df 생성하기
df1=pd.DataFrame(data1,columns=['names','years','points'])
print(df1)

# 행, 열 바꾸기 2
df2=pd.DataFrame(data).transpose()
df2.columns=['names','years','points']
df2.index=['one','two','three','four','five']
print(df2)
df2.describe()

Empty DataFrame
Columns: [names, years, points]
Index: []
      names years points
one      민준  2013    1.5
two      현우  2014    1.7
three    서연  2013    3.6
four     동현  2015    2.4
five     지현  2016    2.9

       names  years  points
count      5      5     5.0
unique     5      4     5.0
top       민준   2013     1.5
freq       1      2     1.0

In [74]:
# df3=df2[['years','points']]
# df3

In [82]:
# 필드 하나의 값을 가져올 때
print(df3['names'])
print(df3.names)
print(df3.points)

# 여러 필드의 값을 가져올 때
print(df3[['names','points']])

one      민준
two      현우
three    서연
four     동현
five     지현
Name: names, dtype: object
one      민준
two      현우
three    서연
four     동현
five     지현
Name: names, dtype: object
one      1.5
two      1.7
three    3.6
four     2.4
five     2.9
Name: points, dtype: float64
      names  points
one      민준     1.5
two      현우     1.7
three    서연     3.6
four     동현     2.4
five     지현     2.9

In [130]:
#df3['penalty']=0.5
#df3['penalty']=[0.5,0.1,.3,3.5,.4]
#df3.penalty=0.1 # 필드가 있는 경우 .필드명으로 접근 가능
#df3['abc']=0.1 # 필드가 존재하지 않는 경우 값 추가하는 방법
#df3['abc']=np.arange(5)
#df3.abc=np.arange(5) # 필드가 생성되었으므로 .필드명으로 접근 가능
#df3.abc

# 생성된 데이터 프레임의 필드 단위로 데이터를 읽을 때 df이름.필드명 / df이름['필드명']
# 으로 데이터를 읽을 수 있다.
# 존재하지 않는 필드일 경우 df이름['필드명']=value으로 필드를 생성한 후 조회 가능

In [ ]:
# 필드 삭제
#del df3['abc'];df3
# 한 줄에 명령어를 두 개 작성하는 경우 ;으로 구분
df3

In [141]:
# 행 선택
df3[0:3]
df3['one':'three']

# df3[0] 혹은 df3['one'] 으로 행을 검색하는 것은 안 됨

df3.loc['one'] # loc를 붙여주어야 원하는 행만 검색 가능
df3.loc['one':'three','names':'years']
df3.loc[:,'points']

index_name
one      1.5
two      1.7
three    3.6
four     2.4
five     2.9
Name: points, dtype: float64

In [151]:
#DataFrame 행 선택 및 조작
print(df3.loc['two'])
print(df3.loc['two':'four'])
print(df3.loc['two':'four','points'])
print(df3.loc[:,'years'])# == df['year']
print(df3.loc[:,['years','names']])
print(df3.loc['three':'five','years':'penalty'])

Column_name
names        현우
years      2014
points      1.7
penalty     0.1
Name: two, dtype: object
Column_name names  years  points  penalty
index_name
two            현우   2014     1.7      0.1
three          서연   2013     3.6      0.1
four           동현   2015     2.4      0.1
index_name
two      1.7
three    3.6
four     2.4
Name: points, dtype: float64
index_name
one      2013
two      2014
three    2013
four     2015
five     2016
Name: years, dtype: int64
Column_name  years names
index_name
one           2013    민준
two           2014    현우
three         2013    서연
four          2015    동현
five          2016    지현
Column_name  years  points  penalty
index_name
three         2013     3.6      0.1
four          2015     2.4      0.1
five          2016     2.9      0.1

In [148]:
# 숫자로 행 찾기
df3.iloc[1:4,0]

index_name
two      현우
three    서연
four     동현
Name: names, dtype: object

In [153]:
# 존재하지 않는 행에 새로운 데이터를 추가
df3.loc['six',:]=['소윤',2017,4.0,2.5];df3

Column_name names   years  points  penalty
index_name
one            민준  2013.0     1.5      0.1
two            현우  2014.0     1.7      0.1
three          서연  2013.0     3.6      0.1
four           동현  2015.0     2.4      0.1
five           지현  2016.0     2.9      0.1
six            소윤  2017.0     4.0      2.5

In [155]:
# iloc로 행 찾기
print(df3.iloc[3])
print(df3.iloc[3:5,0:2])
print(df3.iloc[[0,1,3],[1,2]])
print(df3.iloc[:,1:4])
print(df3.iloc[1,1])

Column_name
names          동현
years      2015.0
points        2.4
penalty       0.1
Name: four, dtype: object
Column_name names   years
index_name
four           동현  2015.0
five           지현  2016.0
Column_name   years  points
index_name
one          2013.0     1.5
two          2014.0     1.7
four         2015.0     2.4
Column_name   years  points  penalty
index_name
one          2013.0     1.5      0.1
two          2014.0     1.7      0.1
three        2013.0     3.6      0.1
four         2015.0     2.4      0.1
five         2016.0     2.9      0.1
six          2017.0     4.0      2.5
2014.0

In [157]:
# 조건으로 행 검색
print(df3['years']>2014)

index_name
one      False
two      False
three    False
four      True
five      True
six       True
Name: years, dtype: bool

In [172]:
df3.loc[df3['years']>2014,:]
df3.loc[df3.years>2014,:]
df3.loc[df3.names=='소윤',:]
df3.loc[(df3.points>2) & (df3.points <3),:]

# 새로운 값 넣기
df3.loc[df3.points>3,'penalty']=0 # point가 3보다 큰 penalty 값에 0 대입
df3

Column_name names   years  points  penalty
index_name
one            민준  2013.0     1.5      0.1
two            현우  2014.0     1.7      0.1
three          서연  2013.0     3.6      0.0
four           동현  2015.0     2.4      0.1
five           지현  2016.0     2.9      0.1
six            소윤  2017.0     4.0      0.0

In [179]:
# DateTime 자료형 indexing
df3=pd.DataFrame(np.random.rand(6,4));df3
df3.columns=['A','B','C','D']
df3.index=pd.date_range('20220501', periods=6)
df3['F']=[1.0,np.nan,3.5,6.1,np.nan,7.0];df3

                   A         B         C         D    F
2022-05-01  0.590249  0.738803  0.220833  0.616861  1.0
2022-05-02  0.410413  0.677501  0.173513  0.134729  NaN
2022-05-03  0.261547  0.782241  0.613744  0.794049  3.5
2022-05-04  0.755676  0.163997  0.974746  0.516858  6.1
2022-05-05  0.653996  0.138302  0.687212  0.529972  NaN
2022-05-06  0.455344  0.557565  0.442821  0.246410  7.0

In [197]:
# NaN 값이 있는 행 지우기
df3.dropna(how='all');df3 
# df에서는 원래 df에서 데이터 삭제 불가능
# 데이터 값을 받는 새로운 df에서만 삭제 가능
# 원본을 남겨둠
df4=df3.dropna(how='any');df4

# NaN 값이 있는 행에 데이터 추가
df5=df3.fillna(value=0.5);df5

# NaN 값이 있는지 체크
df3.isnull()
df3.loc[df3.isnull()['F'],:] # F에 null이 있는 행을 추출
# null 값이 있는 경우 데이터 분석 결과가 null이 되는 경우가 있기 때문에
# null 값이 있는 행을 삭제하고 연산하도록 한다

                   A         B         C         D   F
2022-05-02  0.410413  0.677501  0.173513  0.134729 NaN
2022-05-05  0.653996  0.138302  0.687212  0.529972 NaN

In [196]:
#timestamp
pd.to_datetime('20220101052233')

Timestamp('2022-01-01 05:22:33')

In [195]:
# 데이터 삭제(복수의 인덱스를 사용하여)
df4=df3.drop([pd.to_datetime('20220503'),pd.to_datetime('20220504')]);df4

                   A         B         C         D    F
2022-05-01  0.590249  0.738803  0.220833  0.616861  1.0
2022-05-02  0.410413  0.677501  0.173513  0.134729  NaN
2022-05-05  0.653996  0.138302  0.687212  0.529972  NaN
2022-05-06  0.455344  0.557565  0.442821  0.246410  7.0

In [200]:
df4=df3.drop(['D','F'],axis=1);df4 # 열을 삭제할 때는 축axis를 지정해야 한다

                   A         B         C
2022-05-01  0.590249  0.738803  0.220833
2022-05-02  0.410413  0.677501  0.173513
2022-05-03  0.261547  0.782241  0.613744
2022-05-04  0.755676  0.163997  0.974746
2022-05-05  0.653996  0.138302  0.687212
2022-05-06  0.455344  0.557565  0.442821

In [201]:
df2=df3.drop(['one','three']);df2 # 행 삭제시에는 축axis를 지정하지 않아도 됨

KeyError: "['one', 'three'] not found in axis"